brew "ast-grep"
brew "bat"
brew "chezmoi"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "imagemagick"
brew "lazygit"
brew "luarocks"
brew "mas"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "ruby-build"
brew "tectonic"
brew "wget"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "betterdisplay"
cask "brave-browser"
cask "docker"
cask "dropbox"
cask "firefox"
cask "folx"
cask "font-jetbrains-mono-nerd-font"
cask "foxitreader"
cask "ghostty"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "maccy"
cask "namechanger"
cask "naver-whale"
cask "parallels"
cask "pdf-expert"
cask "private-internet-access"
cask "raycast"
cask "skim"
cask "stats"
cask "the-unarchiver"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Hancom Office HWP Viewer", id: 416746898
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "nPlayer", id: 1451273814
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PhonetiKey", id: 936601789
mas "Spark", id: 1176895641
mas "TextSniper", id: 1528890965
vscode "adpyke.codesnap"
vscode "ankitcode.firefly"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "dan-c-underwood.arm"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gerane.theme-batman"
vscode "github.vscode-pull-request-github"
vscode "jgclark.vscode-todo-highlight"
vscode "jinxdash.prettier-rust"
vscode "juanmnl.vscode-theme-1984"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-typescript-next"
vscode "oderwat.indent-rainbow"
vscode "pranaygp.vscode-css-peek"
vscode "ritwickdey.liveserver"
vscode "rmarinbe.icy-sunset"
vscode "rust-lang.rust-analyzer"
vscode "sallar.vscode-duotone-dark"
vscode "samuelcastillo.batman-dark-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "solnurkarim.html-to-css-autocompletion"
vscode "splashcard.icy-dark"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vikassharma.the-dark-knight"
vscode "vscodestylized.cold-black"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
